---
kind: property
id: P:Autodesk.Revit.DB.Visual.AssetPropertyFloat.Value
source: html/1150ebd5-c161-c925-2088-6bdf10d1cd3b.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyFloat.Value Property

The value of the property.

## Syntax (C#)
```csharp
public float Value { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The input value is invalid for this AssetPropertyFloat property.
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: The asset property is not editable.